================================================================================
statements - surrounded by semis
================================================================================

;;;;;;;;;;;;;
const a := 2;
type q : int;
;;;;;;;;;;;;;

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal)))
  (type_declaration
    (identifier)
    (primitive_type)))

================================================================================
statements - with semis
================================================================================

const a := 2;
type q : int;

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal)))
  (type_declaration
    (identifier)
    (primitive_type)))

================================================================================
constvar declaration - full
================================================================================

const a : boolean := b
var a : boolean := b

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    name: (identifier)
    type_spec: (primitive_type)
    initializer: (identifier))
  (constvar_declaration
    name: (identifier)
    type_spec: (primitive_type)
    initializer: (identifier)))

================================================================================
constvar declaration - type only
================================================================================

const a : boolean
var a : boolean

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (primitive_type))
  (constvar_declaration
    (identifier)
    (primitive_type)))

================================================================================
constvar declaration - init only
================================================================================

const a := b
var a := b

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (identifier))
  (constvar_declaration
    (identifier)
    (identifier)))

================================================================================
constvar declaration - missing both
================================================================================

const a
var a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier))
  (constvar_declaration
    (identifier)))

================================================================================
constvar declaration - pervasive attr
================================================================================

const pervasive a
var pervasive a

const * a
var * a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (pervasive_attr)
    (identifier))
  (constvar_declaration
    (pervasive_attr)
    (identifier))
  (constvar_declaration
    (pervasive_attr)
    (identifier))
  (constvar_declaration
    (pervasive_attr)
    (identifier)))

================================================================================
constvar declaration - register attr
================================================================================

const register a
var register a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (register_attr)
    (identifier))
  (constvar_declaration
    (register_attr)
    (identifier)))

================================================================================
constvar declaration - attr ordering
================================================================================

const pervasive register a
var register pervasive a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (pervasive_attr)
    (register_attr)
    (identifier))
  (constvar_declaration
    (register_attr)
    (identifier))
  (ERROR
    (identifier)))

================================================================================
constvar declaration - multiple names
================================================================================

const a, b, c, d : int

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    name: (identifier)
    name: (identifier)
    name: (identifier)
    name: (identifier)
    type_spec: (primitive_type)))

================================================================================
constvar declaration - alt eq
================================================================================

const a = 1
var b = 2

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier))
  (ERROR)
  (constvar_declaration
    (identifier))
  (ERROR))

================================================================================
type declaration - full
================================================================================

type a : boolean
type a : forward

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (primitive_type))
  (type_declaration
    name: (identifier)
    type_spec: (forward_type)))

================================================================================
type declaration - pervasive
================================================================================

type pervasive a : boolean
type * a : boolean

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (pervasive_attr)
    (identifier)
    (primitive_type))
  (type_declaration
    (pervasive_attr)
    (identifier)
    (primitive_type)))

================================================================================
type declaration - missing colon
================================================================================

type a boolean

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (identifier)))

================================================================================
bind declaration - single
================================================================================

bind a to 1

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - many items
================================================================================

bind a to 1, b to 2, c to 3

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - trailing comma
================================================================================

bind a to 1,
bind a to 1, b to 2, c to 3,

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (ERROR
        (identifier))
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal))))
  (ERROR))

================================================================================
bind declaration - with attrs
================================================================================

bind
  var a to 1,
  register b to 2,
  var register c to 3

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (var_attr)
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (register_attr)
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (var_attr)
      (register_attr)
      (identifier)
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - backwards attrs
================================================================================

bind register var c to 3

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (register_attr)
      name: (identifier)
      (ERROR
        (identifier))
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - followed by constvar
================================================================================

bind a to b
var wa : int

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (identifier)))
  (constvar_declaration
    (identifier)
    (primitive_type)))

================================================================================
bind declaration - error recovery, followed by constvar
================================================================================

bind a to b,
var wa : int

var wow : int % resync

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (identifier)))
  (ERROR
    (ERROR
      (var_attr)
      (identifier))
    (var_attr)
    (identifier))
  (line_comment))

================================================================================
loop statement - normal
================================================================================
loop end loop

--------------------------------------------------------------------------------

(source_file
  (loop_statement))

================================================================================
loop statement - nesting
================================================================================
loop
  loop
  end loop
end loop

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop_statement)))

================================================================================
loop statement - missing final end loop
================================================================================

loop end
var a := 1

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (MISSING "loop"))
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal))))

================================================================================
loop statement - with endloop
================================================================================

loop endloop
var a := 1

--------------------------------------------------------------------------------

(source_file
  (loop_statement)
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal))))

================================================================================
for statement - increasing
================================================================================

for a : 1 .. 3 end for
for a : 1 .. 3 by 1 end for

--------------------------------------------------------------------------------

(source_file
  (for_statement
    name: (identifier)
    start: (literal_expression
      (integer_literal))
    end: (literal_expression
      (integer_literal)))
  (for_statement
    name: (identifier)
    start: (literal_expression
      (integer_literal))
    end: (literal_expression
      (integer_literal))
    step_by: (literal_expression
      (integer_literal))))

================================================================================
for statement - decreasing
================================================================================

for decreasing a : 1 .. 3 end for
for decreasing a : 1 .. 3 by 1 end for

--------------------------------------------------------------------------------

(source_file
  (for_statement
    name: (identifier)
    start: (literal_expression
      (integer_literal))
    end: (literal_expression
      (integer_literal)))
  (for_statement
    name: (identifier)
    start: (literal_expression
      (integer_literal))
    end: (literal_expression
      (integer_literal))
    step_by: (literal_expression
      (integer_literal))))

================================================================================
for statement - no counter name
================================================================================

for : 1 .. 3 end for
for decreasing : 1 .. 3 end for

--------------------------------------------------------------------------------

(source_file
  (for_statement
    start: (literal_expression
      (integer_literal))
    end: (literal_expression
      (integer_literal)))
  (for_statement
    start: (literal_expression
      (integer_literal))
    end: (literal_expression
      (integer_literal))))

================================================================================
for statement - single bound
================================================================================

for : 1 end for
% technically valid syntax, but not valid sematically
% that's a job for toco
for decreasing : 1 end for

--------------------------------------------------------------------------------

(source_file
  (for_statement
    bounds: (literal_expression
      (integer_literal)))
  (line_comment)
  (line_comment)
  (for_statement
    bounds: (literal_expression
      (integer_literal))))

================================================================================
for statement - missing bounds
================================================================================

for :
end for

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)))

================================================================================
for statement - with endfor
================================================================================

for : 1 endfor

--------------------------------------------------------------------------------

(source_file
  (for_statement
    bounds: (literal_expression
      (integer_literal))))

================================================================================
for statement - missing final for
================================================================================

for : 1 end 
var a := 1

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (literal_expression
      (integer_literal))
    (MISSING "for"))
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal))))

================================================================================
exit statement - plain
================================================================================

exit

--------------------------------------------------------------------------------

(source_file
  (exit_statement))

================================================================================
exit statement - with condition
================================================================================

exit when true

--------------------------------------------------------------------------------

(source_file
  (exit_statement
    condition: (literal_expression
      (boolean_literal))))

================================================================================
exit statement - missing condition
================================================================================

loop
  exit when 
end loop

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (exit_statement
      condition: (identifier))))

================================================================================
if statement - bare
================================================================================

if true then
  if false then end if
end if

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (if_statement
      condition: (literal_expression
        (boolean_literal)))))

================================================================================
if statement - if else
================================================================================

if true then
  loop end loop
else 
  var a := 1
end if

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (loop_statement)
    (else_clause
      (constvar_declaration
        name: (identifier)
        initializer: (literal_expression
          (integer_literal))))))

================================================================================
if statement - if elsif
================================================================================

if true then
  var a := 1
elsif false then
  loop end loop
elsif false then
  exit
end if

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (constvar_declaration
      name: (identifier)
      initializer: (literal_expression
        (integer_literal)))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal))
      (loop_statement))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal))
      (exit_statement))))

================================================================================
if statement - if elsif else
================================================================================

if true then
  var a := 1
elsif false then
  loop end loop
elsif false then
  exit
else
  exit when true
end if

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (constvar_declaration
      name: (identifier)
      initializer: (literal_expression
        (integer_literal)))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal))
      (loop_statement))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal))
      (exit_statement))
    (else_clause
      (exit_statement
        condition: (literal_expression
          (boolean_literal))))))

================================================================================
if statement - elsif variations
================================================================================

if true then
elseif true then
elif true then
end if

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal)))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal)))))

================================================================================
if statement - endif
================================================================================

if true then
elsif true then
else
endif

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (elsif_clause
      condition: (literal_expression
        (boolean_literal)))
    (else_clause)))

================================================================================
if statement - missing final if
================================================================================

if true then
  loop end loop
end

--------------------------------------------------------------------------------

(source_file
  (if_statement
    condition: (literal_expression
      (boolean_literal))
    (loop_statement)
    (MISSING "if")))

================================================================================
if statement - bare else
================================================================================

else
  loop end loop
end if

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier))
  (loop_statement)
  (ERROR
    (identifier)
    (identifier)))

================================================================================
if statement - bare elsif
================================================================================

elsif true then
  loop end loop
end if

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (identifier))
  (loop_statement)
  (ERROR
    (identifier)
    (identifier)))

================================================================================
if statement - bare elseif
================================================================================

elseif true then
  loop end loop
end if

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (identifier))
  (loop_statement)
  (ERROR
    (identifier)
    (identifier)))

================================================================================
if statement - bare elif
================================================================================

elif true then
  loop end loop
end if

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (identifier))
  (loop_statement)
  (ERROR
    (identifier)
    (identifier)))

================================================================================
if statement - missing condition
================================================================================

if then
  loop end loop
end if

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (identifier)))

================================================================================
if statement - missing then
================================================================================

if true
  loop end loop
end if

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (literal_expression
      (boolean_literal))
    (identifier)))

================================================================================
case statement - no arms
================================================================================

case true of
end case

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))))

================================================================================
case statement - empty arm
================================================================================

case true of
label 1:
end case

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))
    (case_arm
      pattern: (literal_expression
        (integer_literal)))))

================================================================================
case statement - empty patterns
================================================================================

case true of
label :
end case

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))
    (case_arm)))

================================================================================
case statement - one arm
================================================================================

case true of
label 1:
  loop end loop
end case

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))
    (case_arm
      pattern: (literal_expression
        (integer_literal))
      (loop_statement))))

================================================================================
case statement - multiple arms
================================================================================

case true of
label 1:
  loop end loop
label :
  loop end loop
label 3:
  loop end loop
end case

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))
    (case_arm
      pattern: (literal_expression
        (integer_literal))
      (loop_statement))
    (case_arm
      (loop_statement))
    (case_arm
      pattern: (literal_expression
        (integer_literal))
      (loop_statement))))

================================================================================
case statement - multiple patterns
================================================================================

case true of
label 1, 2, 3, 4, 5:
  loop end loop
end case

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))
    (case_arm
      pattern: (literal_expression
        (integer_literal))
      pattern: (literal_expression
        (integer_literal))
      pattern: (literal_expression
        (integer_literal))
      pattern: (literal_expression
        (integer_literal))
      pattern: (literal_expression
        (integer_literal))
      (loop_statement))))

================================================================================
case statement - with endcase
================================================================================

case true of endcase

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))))

================================================================================
case statement - missing final case
================================================================================

case true of end

--------------------------------------------------------------------------------

(source_file
  (case_statement
    condition: (literal_expression
      (boolean_literal))
    (MISSING "case")))

================================================================================
block statement
================================================================================

begin
  begin end
end

--------------------------------------------------------------------------------

(source_file
  (block_statement
    (block_statement)))

================================================================================
assign statement
================================================================================

a := b
1 := 2 % handled by typeck, not the parser

--------------------------------------------------------------------------------

(source_file
  (assign_statement
    left: (identifier)
    right: (identifier))
  (assign_statement
    left: (literal_expression
      (integer_literal))
    right: (literal_expression
      (integer_literal)))
  (line_comment))

================================================================================
compound assign statement
================================================================================

a => = b
a or = b
a | = b
a and = b
a & = b
a + = b
a - = b
a xor = b
a * = b
a / = b
a div = b
a mod = b
a rem = b
a shl = b
a shr = b
a ** = b

--------------------------------------------------------------------------------

(source_file
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier))
  (compound_assign_statement
    left: (identifier)
    right: (identifier)))
