================================================================================
statements - surrounded by semis
================================================================================

;;;;;;;;;;;;;
const a := 2;
type q : int;
;;;;;;;;;;;;;

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal)))
  (type_declaration
    (identifier)
    (primitive_type)))

================================================================================
statements - with semis
================================================================================

const a := 2;
type q : int;

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (literal_expression
      (integer_literal)))
  (type_declaration
    (identifier)
    (primitive_type)))

================================================================================
constvar declaration - full
================================================================================

const a : boolean := b
var a : boolean := b

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    name: (identifier)
    type_spec: (primitive_type)
    initializer: (identifier))
  (constvar_declaration
    name: (identifier)
    type_spec: (primitive_type)
    initializer: (identifier)))

================================================================================
constvar declaration - type only
================================================================================

const a : boolean
var a : boolean

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (primitive_type))
  (constvar_declaration
    (identifier)
    (primitive_type)))

================================================================================
constvar declaration - init only
================================================================================

const a := b
var a := b

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier)
    (identifier))
  (constvar_declaration
    (identifier)
    (identifier)))

================================================================================
constvar declaration - missing both
================================================================================

const a
var a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (identifier))
  (constvar_declaration
    (identifier)))

================================================================================
constvar declaration - register attr
================================================================================

const register a
var register a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (register_attr)
    (identifier))
  (constvar_declaration
    (register_attr)
    (identifier)))

================================================================================
constvar declaration - attr ordering
================================================================================

const pervasive register a
var register pervasive a

--------------------------------------------------------------------------------

(source_file
  (constvar_declaration
    (pervasive_attr)
    (register_attr)
    (identifier))
  (constvar_declaration
    (register_attr)
    (identifier))
  (ERROR
    (identifier)))

================================================================================
type declaration - full
================================================================================

type a : boolean
type a : forward

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (primitive_type))
  (type_declaration
    name: (identifier)
    type_spec: (forward_type)))

================================================================================
type declaration - pervasive
================================================================================

type pervasive a : boolean
type * a : boolean

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (pervasive_attr)
    (identifier)
    (primitive_type))
  (type_declaration
    (pervasive_attr)
    (identifier)
    (primitive_type)))

================================================================================
type declaration - missing colon
================================================================================

type a boolean

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (identifier)))

================================================================================
bind declaration - single
================================================================================

bind a to 1

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - many items
================================================================================

bind a to 1, b to 2, c to 3

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - trailing comma
================================================================================

bind a to 1,
bind a to 1, b to 2, c to 3,

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (ERROR
        (identifier))
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (identifier)
      (literal_expression
        (integer_literal))))
  (ERROR))

================================================================================
bind declaration - with attrs
================================================================================

bind
  var a to 1,
  register b to 2,
  var register c to 3

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (var_attr)
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (register_attr)
      (identifier)
      (literal_expression
        (integer_literal)))
    (bind_item
      (var_attr)
      (register_attr)
      (identifier)
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - backwards attrs
================================================================================

bind register var c to 3

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (register_attr)
      name: (identifier)
      (ERROR
        (identifier))
      (literal_expression
        (integer_literal)))))

================================================================================
bind declaration - followed by constvar
================================================================================

bind a to b
var wa : int

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (identifier)))
  (constvar_declaration
    (identifier)
    (primitive_type)))

================================================================================
bind declaration - error recovery, followed by constvar
================================================================================

bind a to b,
var wa : int

var wow : int % resync

--------------------------------------------------------------------------------

(source_file
  (bind_declaration
    (bind_item
      (identifier)
      (identifier)))
  (ERROR
    (ERROR
      (var_attr)
      (identifier))
    (var_attr)
    (identifier))
  (line_comment))
