================================================================================
primitive ty - simple
================================================================================

type a : boolean
type a : addressint
type a : int
type a : int1
type a : int2
type a : int4
type a : nat
type a : nat1
type a : nat2
type a : nat4
type a : real
type a : real4
type a : real8
type a : char
type a : string

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type)))

================================================================================
primitive ty - const sized
================================================================================

type a : char(a)
type a : string(a)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size
        (nameref_expression
          (path_component
            (identifier))))))
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size
        (nameref_expression
          (path_component
            (identifier)))))))

================================================================================
primitive ty - dyn sized
================================================================================

type a : char(*)
type a : string(*)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size)))
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size))))

================================================================================
range type - start and end
================================================================================

type a : 1 .. 2

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (range_type
      start: (literal_expression
        (integer_literal))
      end: (literal_expression
        (integer_literal)))))

================================================================================
range type - only start
================================================================================

type a : 1 ..

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (range_type
      start: (literal_expression
        (integer_literal))
      end: (nameref_expression
        (path_component
          (MISSING identifier))))))

================================================================================
range type - only end
================================================================================

type a : .. 2

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (range_type
      start: (nameref_expression
        (path_component
          (MISSING identifier)))
      end: (literal_expression
        (integer_literal)))))

================================================================================
range type - no bounds
================================================================================

type a : ..

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)))

================================================================================
expression in type position
================================================================================

type a : 1 + 1

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (binary_expression
      (literal_expression
        (integer_literal))
      (literal_expression
        (integer_literal)))))

================================================================================
enum ty - no variants
================================================================================

type e : enum()

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type)))

================================================================================
enum ty - no variants with size
================================================================================

type e : enum() : 4

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      size_spec: (literal_expression
        (integer_literal)))))

================================================================================
enum ty - one variant
================================================================================

type e : enum(a)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      variant: (identifier))))

================================================================================
enum ty - packed one variant
================================================================================

type e : packed enum(a)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      (packed_attr)
      variant: (identifier))))

================================================================================
enum ty - one variant with size
================================================================================

type e : enum(a) : 4

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      variant: (identifier)
      size_spec: (literal_expression
        (integer_literal)))))

================================================================================
enum ty - many variants
================================================================================

type e : enum(a, b, c, d, e, f)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier))))

================================================================================
enum ty - packed many variants
================================================================================

type e : packed enum(a, b, c, d, e, f)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      (packed_attr)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier))))

================================================================================
enum ty - many variants with size
================================================================================

type e : enum(a, b, c, d, e, f) : 4

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (enum_type
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      variant: (identifier)
      size_spec: (literal_expression
        (integer_literal)))))

================================================================================
set ty - normal
================================================================================

type e : set of int1

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (set_type
      element_type: (primitive_type))))

================================================================================
set ty - packed
================================================================================

type e : packed set of int1

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (set_type
      (packed_attr)
      element_type: (primitive_type))))

================================================================================
set ty - with size
================================================================================

type e : set of int1 : 2

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (set_type
      element_type: (primitive_type)
      size_spec: (literal_expression
        (integer_literal)))))

================================================================================
pointer ty - normal
================================================================================

type p : pointer to int
type p : ^int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      element_type: (primitive_type)))
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      element_type: (primitive_type))))

================================================================================
pointer ty - checked
================================================================================

type p : checked pointer to int
type p : checked ^int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      checkedness: (checked_attr)
      element_type: (primitive_type)))
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      checkedness: (checked_attr)
      element_type: (primitive_type))))

================================================================================
pointer ty - unchecked
================================================================================

type p : unchecked pointer to int
type p : unchecked ^int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      checkedness: (unchecked_attr)
      element_type: (primitive_type)))
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      checkedness: (unchecked_attr)
      element_type: (primitive_type))))

================================================================================
pointer ty - nested
================================================================================

type p : unchecked pointer to checked^^ pointer to int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (pointer_type
      checkedness: (unchecked_attr)
      element_type: (pointer_type
        checkedness: (checked_attr)
        element_type: (pointer_type
          element_type: (pointer_type
            element_type: (primitive_type)))))))

================================================================================
function ty - normal
================================================================================

type a : function() : int
type a : fcn() : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      params: (param_spec)
      result_type: (primitive_type)))
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      params: (param_spec)
      result_type: (primitive_type))))

================================================================================
function ty - with unused name
================================================================================

type a : function name() : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec)
      result_type: (primitive_type))))

================================================================================
function ty - with no params
================================================================================

type a : function : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      result_type: (primitive_type))))

================================================================================
function ty - with constvar param
================================================================================

type a : function name(a : int) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (constvar_param
          name: (identifier)
          param_type: (primitive_type)))
      result_type: (primitive_type))))

================================================================================
function ty - with function param
================================================================================

type a : function name(fcn() : int) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (function_type
          params: (param_spec)
          result_type: (primitive_type)))
      result_type: (primitive_type))))

================================================================================
function ty - with named function param
================================================================================

type a : function name(fcn a() : int) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (function_type
          name: (identifier)
          params: (param_spec)
          result_type: (primitive_type)))
      result_type: (primitive_type))))

================================================================================
function ty - with named procedure param
================================================================================

type a : function name(proc a()) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (procedure_type
          name: (identifier)
          params: (param_spec)))
      result_type: (primitive_type))))

================================================================================
procedure ty - normal
================================================================================

type a : procedure()
type a : proc()

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      params: (param_spec)))
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      params: (param_spec))))

================================================================================
procedure ty - with unused name
================================================================================

type a : procedure name()

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec))))

================================================================================
procedure ty - with no params
================================================================================

type a : procedure

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type)))

================================================================================
procedure ty - with constvar param
================================================================================

type a : procedure name(a : int)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (constvar_param
          name: (identifier)
          param_type: (primitive_type))))))

================================================================================
procedure ty - with function param
================================================================================

type a : procedure name(fcn() : int)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (function_type
          params: (param_spec)
          result_type: (primitive_type))))))

================================================================================
procedure ty - with named function param
================================================================================

type a : procedure name(fcn a() : int)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (function_type
          name: (identifier)
          params: (param_spec)
          result_type: (primitive_type))))))

================================================================================
procedure ty - with named procedure param
================================================================================

type a : procedure name(proc a())

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (procedure_type
          name: (identifier)
          params: (param_spec))))))

===============================================================================
collection type - concrete type
===============================================================================

type a : collection of int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (collection_type
      element_type: (primitive_type))))

===============================================================================
collection type - forward declared type
===============================================================================

type a : collection of forward thing

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (collection_type
      name: (identifier))))

===============================================================================
condition type
===============================================================================

type a : condition
type a : priority condition
type a : deferred condition
type a : timeout condition

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (condition_type))
  (type_declaration
    name: (identifier)
    type_spec: (condition_type))
  (type_declaration
    name: (identifier)
    type_spec: (condition_type))
  (type_declaration
    name: (identifier)
    type_spec: (condition_type)))
