================================================================================
primitive ty - simple
================================================================================

type a : boolean
type a : addressint
type a : int
type a : int1
type a : int2
type a : int4
type a : nat
type a : nat1
type a : nat2
type a : nat4
type a : real
type a : real4
type a : real8
type a : char
type a : string

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type))
  (type_declaration
    (identifier)
    (primitive_type)))

================================================================================
primitive ty - const sized
================================================================================

type a : char(a)
type a : string(a)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size
        (nameref_expression
          (path_component
            (identifier))))))
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size
        (nameref_expression
          (path_component
            (identifier)))))))

================================================================================
primitive ty - dyn sized
================================================================================

type a : char(*)
type a : string(*)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size)))
  (type_declaration
    (identifier)
    (primitive_type
      (charseq_size))))

================================================================================
range type - start and end
================================================================================

type a : 1 .. 2

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (range_type
      start: (literal_expression
        (integer_literal))
      end: (literal_expression
        (integer_literal)))))

================================================================================
range type - only start
================================================================================

type a : 1 ..

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (range_type
      start: (literal_expression
        (integer_literal))
      end: (nameref_expression
        (path_component
          (MISSING identifier))))))

================================================================================
range type - only end
================================================================================

type a : .. 2

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (range_type
      start: (nameref_expression
        (path_component
          (MISSING identifier)))
      end: (literal_expression
        (integer_literal)))))

================================================================================
range type - no bounds
================================================================================

type a : ..

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)))

================================================================================
expression in type position
================================================================================

type a : 1 + 1

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (identifier)
    (binary_expression
      (literal_expression
        (integer_literal))
      (literal_expression
        (integer_literal)))))

================================================================================
function ty - normal
================================================================================

type a : function() : int
type a : fcn() : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      params: (param_spec)
      result_type: (primitive_type)))
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      params: (param_spec)
      result_type: (primitive_type))))

================================================================================
function ty - with unused name
================================================================================

type a : function name() : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec)
      result_type: (primitive_type))))

================================================================================
function ty - with no params
================================================================================

type a : function : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      result_type: (primitive_type))))

================================================================================
function ty - with constvar param
================================================================================

type a : function name(a : int) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (constvar_param
          name: (identifier)
          param_type: (primitive_type)))
      result_type: (primitive_type))))

================================================================================
function ty - with function param
================================================================================

type a : function name(fcn() : int) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (function_type
          params: (param_spec)
          result_type: (primitive_type)))
      result_type: (primitive_type))))

================================================================================
function ty - with named function param
================================================================================

type a : function name(fcn a() : int) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (function_type
          name: (identifier)
          params: (param_spec)
          result_type: (primitive_type)))
      result_type: (primitive_type))))

================================================================================
function ty - with named procedure param
================================================================================

type a : function name(proc a()) : int

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (function_type
      name: (identifier)
      params: (param_spec
        (procedure_type
          name: (identifier)
          params: (param_spec)))
      result_type: (primitive_type))))

================================================================================
procedure ty - normal
================================================================================

type a : procedure()
type a : proc()

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      params: (param_spec)))
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      params: (param_spec))))

================================================================================
procedure ty - with unused name
================================================================================

type a : procedure name()

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec))))

================================================================================
procedure ty - with no params
================================================================================

type a : procedure

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type)))

================================================================================
procedure ty - with constvar param
================================================================================

type a : procedure name(a : int)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (constvar_param
          name: (identifier)
          param_type: (primitive_type))))))

================================================================================
procedure ty - with function param
================================================================================

type a : procedure name(fcn() : int)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (function_type
          params: (param_spec)
          result_type: (primitive_type))))))

================================================================================
procedure ty - with named function param
================================================================================

type a : procedure name(fcn a() : int)

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (function_type
          name: (identifier)
          params: (param_spec)
          result_type: (primitive_type))))))

================================================================================
procedure ty - with named procedure param
================================================================================

type a : procedure name(proc a())

--------------------------------------------------------------------------------

(source_file
  (type_declaration
    name: (identifier)
    type_spec: (procedure_type
      name: (identifier)
      params: (param_spec
        (procedure_type
          name: (identifier)
          params: (param_spec))))))
